# GetEvaluator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringRule..::..GetEvaluator Method
FilterStringRule Class See Also
---
Gets the evaluator that implements the test for this rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterStringRuleEvaluator GetEvaluator()
```

Visual Basic
---
```text
Public Function GetEvaluator As FilterStringRuleEvaluator
```

Visual C++
---
```text
public:
FilterStringRuleEvaluator^ GetEvaluator()
```

# See Also
FilterStringRule Class
Autodesk.Revit.DB Namespace